; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	infrared0 - mode
	image1 - mode
	GroundStation6 - direction
	GroundStation8 - direction
	GroundStation10 - direction
	GroundStation11 - direction
	Star12 - direction
	Star5 - direction
	Star4 - direction
	GroundStation9 - direction
	Star1 - direction
	Star0 - direction
	Star2 - direction
	GroundStation7 - direction
	GroundStation3 - direction
	Planet13 - direction
	Star14 - direction
	Star15 - direction
	Phenomenon16 - direction
	Planet17 - direction
)
(:init
	(supports instrument0 image1)
	(supports instrument0 infrared0)
	(calibration_target instrument0 Star2)
	(calibration_target instrument0 Star4)
	(calibration_target instrument0 GroundStation9)
	(calibration_target instrument0 Star5)
	(supports instrument1 infrared0)
	(supports instrument1 image1)
	(calibration_target instrument1 GroundStation9)
	(calibration_target instrument1 Star0)
	(supports instrument2 image1)
	(calibration_target instrument2 Star1)
	(calibration_target instrument2 Star2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star0)
	(supports instrument3 image1)
	(calibration_target instrument3 Star0)
	(supports instrument4 image1)
	(calibration_target instrument4 Star2)
	(supports instrument5 infrared0)
	(supports instrument5 image1)
	(calibration_target instrument5 GroundStation3)
	(calibration_target instrument5 GroundStation7)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation11)
)
(:goal (and
	(pointing satellite1 Star14)
	(have_image Planet13 image1)
	(have_image Star14 image1)
	(have_image Star15 infrared0)
	(have_image Phenomenon16 infrared0)
	(have_image Planet17 image1)
))

)

; plan
1. (turn_to satellite1 star14 groundstation11)
   deleted: (pointing satellite1 groundstation11)
   added: (pointing satellite1 star14)
   goals met: 1 of 6
2. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 1 of 6
3. (calibrate satellite0 instrument1 star0)
   added: (calibrated instrument1)
   goals met: 1 of 6
4. (turn_to satellite0 planet13 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 planet13)
   goals met: 1 of 6
5. (take_image satellite0 planet13 instrument1 image1)
   added: (have_image planet13 image1)
   goals met: 2 of 6
6. (turn_to satellite0 phenomenon16 planet13)
   deleted: (pointing satellite0 planet13)
   added: (pointing satellite0 phenomenon16)
   goals met: 2 of 6
7. (take_image satellite0 phenomenon16 instrument1 infrared0)
   added: (have_image phenomenon16 infrared0)
   goals met: 3 of 6
8. (turn_to satellite0 planet17 phenomenon16)
   deleted: (pointing satellite0 phenomenon16)
   added: (pointing satellite0 planet17)
   goals met: 3 of 6
9. (take_image satellite0 planet17 instrument1 image1)
   added: (have_image planet17 image1)
   goals met: 4 of 6
10. (turn_to satellite0 star14 planet17)
   deleted: (pointing satellite0 planet17)
   added: (pointing satellite0 star14)
   goals met: 4 of 6
11. (take_image satellite0 star14 instrument1 image1)
   added: (have_image star14 image1)
   goals met: 5 of 6
12. (turn_to satellite0 star15 star14)
   deleted: (pointing satellite0 star14)
   added: (pointing satellite0 star15)
   goals met: 5 of 6
13. (take_image satellite0 star15 instrument1 infrared0)
   added: (have_image star15 infrared0)
   goals met: 6 of 6
